Repository: marekpridal/ExpensesKit
Catalog: Sources/ExpensesKit/Resources/*.lproj/Localizable.strings
Languages: cs

# BAD_REQUEST_ERROR
source: Something is missing here ⚠️
cs: Vypadá to, že něco není v pořádku. Zkontrolujte prosím, jestli něco neschází ⚠️

# PAYMENT_REQUIRED_ERROR
source: You have to have active subscription for this operation
cs: Pro tuto funkci je potřeba mít aktivní předplatné.

# FORBIDDEN_ERROR
source: There is something missing ❌
cs: Vypadá to, že něco není v pořádku. Zkontrolujte prosím, jestli něco neschází ❌

# CONFLICT_ERROR
source: It looks like this entry already exists ❌
cs: Tenhle záznam u nás už existuje ❌

# REDIRECTION_ERROR
source: It looks like your internet provider is trying to redirect you to Neverland 🔀
cs: Vypadá to, že se Vás někdo snaží přesměrovat 🔀

# GONE_ERROR
source: Please update to latest version from App Store ⤵️
cs: Stáhněte si prosím z App Store aktualizaci aplikace ⤵️

# UPGRADE_REQUIRED_ERROR
source: Please update to latest version from App Store ⤵️
cs: Stáhněte si prosím z App Store aktualizaci aplikace ⤵️

# SERVER_ERROR
source: This is not on your side 😇 Please try it again or contact me 🙌
cs: Chyba není na Vašem přijímači 😇 Zkuste to prosím znovu, případně mi napište na podporu. Za chybu se omlouvám 😔

# NETWORK_AUTHENTICATION_REQUIRED_ERROR
source: Your public Wi-Fi probably requires some further action 🙂
cs: Zkontrolujte prosím, jestli Wi-Fi, na které jste připojeni, nepotřebuje ještě potvrdit podmínky 🙂

# SERVER_IN_MAINTENANCE_ERROR
source: We are currently cleaning up our server, please try it again in a few minutes 🙂
cs: Na serverech zrovna uklízíme, zkuste to prosím za chvíli 🙂

# REQUEST_TIMEOUT_ERROR
source: Request timeout. Try it again.
cs: Časový limit požadavku vypršel. Zkuste to prosím znovu.

# CUSTOM_ERROR_DEFAULT_CURRENCY_MISMATCH
source: Sharing between users with different default currency is not yet supported
cs: Aplikace zatím umí sdílet výdaje jen mezi uživateli se stejnou výchozí měnou

# CUSTOM_ERROR_USER_DOES_NOT_HAVE_ASSOCIATED_EMAIL
source: There is no e-mail address associated with this username and because of that there is no way to reset your password
cs: S tímto uživatelským jménem není spojená žádná e-mailová adresa a z toho důvodu není možné heslo obnovit.

# CUSTOM_ERROR_PASSWORD_RESET_EMAIL_MISMATCH
source: Provided username and email are not correct
cs: Uživatelské jméno a e-mail se neshodují.

# CUSTOM_ERROR_PASSWORD_CHANGE_WRONG_CURRENT_PASSWORD
source: Current password is wrong.
cs: Zadané současné heslo není správné.

# CUSTOM_ERROR_PASSWORD_TOO_WEAK
source: Password is too weak. Please choose stronger.
cs: Zvolené heslo je příliš jednoduché
